# Missing Data :

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
# Creating Dataframe from a Dictionaries : 
d = {'A' : [1,2,np.nan], 'B' : [5, np.nan, np.nan], 'C' : [1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [3]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## 1. Dropping NaN rows/cols having NaN(missing) values:
> Syntax: `df_name.dropna(axis=0/1)`

In [4]:
# Drop all the rows with NaN values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
# Drop all the columns with NaN values
df.dropna(axis=1)

   C
0  1
1  2
2  3

- Dropping as per the threshold value
> Syntax: `df_name.dropna(thresh=integer)`

In [6]:
df.dropna(thresh=2)
# here row '1' is not dropped 'cause it has atleast 2 non-NaN values
# row '2' is dropped 'cause it has less than 2 non-NaN values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [8]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

---

## Replacing/Filling Missing(NaN) values:
> Syntax: `df_name.fillna(value=yourValue)`

In [9]:
df
# use inplace=True, for changing original DataFrame

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [11]:
# Filling a NaN of particular column with its mean value

df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [12]:
df.fillna(value = df.mean(), inplace=True)
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

---